ch8/ch8-problems.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-06-06 Thu 03:07 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Travis CI User" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgfeabb5e">1. ch8-problems</a>
<ul>
<li><a href="#orgbce891a">1.1. 8-1</a></li>
<li><a href="#org6d6649a">1.2. 8-2</a></li>
<li><a href="#orge880abc">1.3. 8-3</a></li>
<li><a href="#org6783985">1.4. 8-4</a></li>
<li><a href="#orgcc36bb6">1.5. 8-5</a></li>
<li><a href="#org9277cb2">1.6. 8-6</a></li>
<li><a href="#org4ee7b7a">1.7. 8-7</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgfeabb5e" class="outline-2">
<h2 id="orgfeabb5e"><span class="section-number-2">1</span> ch8-problems</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgbce891a" class="outline-3">
<h3 id="orgbce891a"><span class="section-number-3">1.1</span> 8-1</h3>
<div class="outline-text-3" id="text-1-1">
<ol class="org-ol">
<li>There are n! premutations, the probability is the same 1 / n!</li>
<li><p>
D(T)
= \(\sum_{i\in T}D_T(i)\)
</p>

<p>
= \(\sum_{i\in LT}D_T(i) + \sum_{i\in RT}D_T(i)\)
</p>

<p>
= \(\sum_{i\in LT}(D_{LT}(i) + 1)\ + \sum_{i\in RT}(D_{RT}(i) + 1)\)
</p>

<p>
= D(LT) + D(RT) + k
</p></li>
<li><p>
d(k)
= min(D(T))
</p>

<p>
= min(D(LT) + D(RT) + k)
</p>

<p>
= \(min_{1 \leq i \leq k - 1}\{D(LT) + D(RT) + k\}\) (We could choose 1 to k - 1 leaves for left node)
</p>

<p>
= \(min_{1 \leq i \leq k - 1}\{min(D(LT)) + min(D(RT) + k)\}\) (The shapes of left node tree and right node tree are arbitrary)
</p>

<p>
= \(min_{1 \leq i \leq k - 1}\{d(i) + d(k - i) + k\}\)
</p></li>
<li><p>
\(f(i) = i\lg i + (k - i)\lg(k - i)\, i \in [1, k - 1]\, find min(f(i))\)
</p>

<p>
\(f'(i) = \frac{1}{\ln 2}[i\frac{1}{i} + \ln i - (k - i)\frac{1}{k - i} - \ln(k - i)]\)
</p>

<p>
\(= \frac{1}{\ln 2}[\ln i - \ln(k - i)]\)
</p>

<p>
f(i) is concave when \(i \in [1, k - 1]\), the critical value is k / 2
</p>

<p>
Then we use substitution method to prove \(d(k) = \Omega(k\lg k)\)
</p>

<ul class="org-ul">
<li>First we assume that \(d(i) \geq c i\lg i\) for some constant c when \(i \in [1, k - 1]\)</li>

<li><p>
Base case
</p>

<p>
\(d(1) > 1 \lg 1 = 0\)
</p></li>

<li><p>
Inductive step
</p>

<p>
\(d(k) = min_{1 \leq i \leq k - 1}\{d(i) + d(k - i) + k\}\)
</p>

<p>
\(\geq min_{1 \leq i \leq k - 1}\{c i\lg i + c (k - 1)\lg(k - i) + k\}\)
</p>

<p>
\(= c k\lg \frac{k}{2} + k\)
</p>

<p>
\(= c k\lg k + (1 - c)k\)
</p>

<p>
\(\geq c k\lg k\) when \(c \leq 1\)
</p></li>
<li>Thus \(d(k) = \Omega{k\lg k}\)</li>
</ul></li>
<li>T<sub>A</sub> has n! leaves, so \(D(T_A) = \Omega(n!\lg(n!))\),
the average-case time to sort n elements is \(\frac{D(T_A)}{n!} = \Omega(lg(n!)) = \Omega(n\lg n)\)</li>
<li>The needed leaves is not reduced from a randomized node to its child, 
so the randomized node could be replaced by a deterministic node with any one of its children</li>
</ol>
</div>
</div>
<div id="outline-container-org6d6649a" class="outline-3">
<h3 id="org6d6649a"><span class="section-number-3">1.2</span> 8-2</h3>
<div class="outline-text-3" id="text-1-2">
<ol class="org-ol">
<li>couting sort</li>
<li>insertion sort</li>
<li>merge sort</li>
<li>The algorithm should be stable and runs in O(n) time</li>
<li><p>
COUNTING-SORT-IN-PLACE(A, k)
</p>
<pre class="example">
COUNTING-SORT-IN-PLACE(A, k)
    let C[0..k] be a new array
    for i = 0 to k
	C[i] = 0
    for j = 1 to A.length
	C[A[j]] = C[A[j]] + 1
    for i = 1 to k
	C[i] = C[i] + C[i - 1]
    j = A.length
    while j &gt;= 1
	p = C[A[j]]
	if j &gt; p
	    j = j - 1
	else exchange A[j] with A[p]
	     C[A[p]] = p - 1
</pre>
<p>
The algorithm is not stable
</p></li>
</ol>
</div>
</div>
<div id="outline-container-orge880abc" class="outline-3">
<h3 id="orge880abc"><span class="section-number-3">1.3</span> 8-3</h3>
<div class="outline-text-3" id="text-1-3">
<ol class="org-ol">
<li><p>
First sort and group the elements by the number of digits, 
Then do radix sort on each group. 
</p>

<p>
Assume there is k groups, the count of elements in ith group is C<sub>i</sub>,
the number of digits of elements in ith group is D<sub>i</sub>,
The running time is T(n) = \(\Theta(\sum^{k}_{i = 1}D_i C_i) = \Theta(n)\)
</p></li>
<li>MSD radix sort (<a href="../codes/radix_sort.py">implementation</a>)</li>
</ol>
</div>
</div>
<div id="outline-container-org6783985" class="outline-3">
<h3 id="org6783985"><span class="section-number-3">1.4</span> 8-4</h3>
<div class="outline-text-3" id="text-1-4">
<ol class="org-ol">
<li>Brute force</li>
<li>Build an decision tree of the problem
<ul class="org-ul">
<li>One comparison of a red water jug and a blue water jug generates three results (&gt;, &lt; and =), 
so in this decision tree a node has at most three children</li>
<li>There are n! possible results of the pairs, so the number of leaves is n!</li>
<li>The heigit of decision tree is h, which \(3^h \geq n!\), \(h = \Omega(n\lg n)\)</li>
<li>Thus the lower bound is \(\Omega(n\lg n)\)</li>
</ul></li>
<li><p>
FIND-WATER-JUGS-GROUPS(R, B)
</p>
<pre class="example">
FIND-WATER-JUGS-GROUPS(R, B)
    if R.length == 0
	return
    r = random jug from R

    // compare all jugs in B with r
    b = jub in B same as r
    BL = jugs in B smaller than r
    BR = jugs in B larger than r

    // compare all jugs in R with b
    RL = jugs in R smaller than b
    RR = jugs in R larger than b

    output the pair of r and b
    FIND-WATER-JUGS-GROUPS(RL, BL)
    FIND-WATER-JUGS-GROUPS(RR. BR)
</pre>
<p>
The expected number of comparisons is \(\Theta(n\lg n)\), 
the worst-case number of comparisons is \(\Theta(n^2)\)
</p></li>
</ol>
</div>
</div>
<div id="outline-container-orgcc36bb6" class="outline-3">
<h3 id="orgcc36bb6"><span class="section-number-3">1.5</span> 8-5</h3>
<div class="outline-text-3" id="text-1-5">
<ol class="org-ol">
<li>1-sorted means normal sorted</li>
<li>{5, 1, 6, 2, 7, 8, 4, 9, 10}</li>
<li><p>
k-sorted means \(\sum_{j = i + 1}^{i + k}A[j] - \sum_{j = i}^{i + k - 1}A[j] = A[i + k] - A[i] \geq 0\)
</p>

<p>
\(\Rightarrow (\forall i\in [1, n - k])[A[i] \leq A[i + k]]\)
</p></li>
<li>The problem is equivilant to get k * (sorting n / k size array), 
when use O(nlg n) sorting algorithm to sort the n / k size array, 
the running time is \(T(n) = k\frac{n}{k}\lg \frac{n}{k} = n\lg \frac{n}{k}\)</li>
<li>Use the solution to exercise 6.5-9, the running time is \(T(n) = O(k) + O(n\lg k) = O(n\lg k)\)</li>
<li>\(T(n) = \Omega(n\lg(n / k)) = \Omega(n(\lg n - \lg k)) = \Omega(n\lg n)\)</li>
</ol>
</div>
</div>
<div id="outline-container-org9277cb2" class="outline-3">
<h3 id="org9277cb2"><span class="section-number-3">1.6</span> 8-6</h3>
<div class="outline-text-3" id="text-1-6">
<ol class="org-ol">
<li>\(\binom{2 n}{n}\) possible ways</li>
<li><p>
The height of the decision tree is h, which \(2^h \geq \binom{2 n}{n}\)
</p>

<p>
\(h \geq \lg \binom{2 n}{n} = 2 n - o(n)\)
</p></li>
<li>The two elements are consecutive means their order can't be decided by comparing to other elements, 
and they are in different lists means their order is unknown, so they must be compared</li>
<li>Consider the merged list of A and B is formed by (A[1], B[1], A[2], B[2]&#x2026;A[n], B[n]), 
2n - 1 comparisons is required.</li>
</ol>
</div>
</div>
<div id="outline-container-org4ee7b7a" class="outline-3">
<h3 id="org4ee7b7a"><span class="section-number-3">1.7</span> 8-7</h3>
<div class="outline-text-3" id="text-1-7">
<ol class="org-ol">
<li>A[q] is put to the wrong location too, 
and A[p] is smallest belong all the wrong elements, so A[p] &lt; A[q]</li>
<li><p>
If every 0-1 sequence of array A is sorted by X, then array A is sorted by X
</p>

<p>
B[p] &lt; B[q] and p &gt; q, so X fails to sort B
</p></li>
<li>The result after each step does not change if we are using compare-exchange 
algorithm in the odd steps or not, so we can treat columnsort as an oblivious 
compare-exchange algorithm</li>
<li>Proofs
<ul class="org-ul">
<li>After step 1, all columns contains only one 0 -&gt; 1 transition</li>
<li>After step 2, each column is transposed to r / s rows, only one of this rows is dirty</li>
<li>After step 3, all columns are composed to 0 -&gt; 1 transition again, all the zeros are 
on the top, and all the ones are on the bottom. The dirty rows come from the differences 
between the numbers of zeros and ones of every columns. From the result of step 2, we 
know the difference is at most s, so there are at most s dirty rows.</li>
</ul></li>
<li>There are at most s dirty rows in after step 3, so after step 4 the dirty area has at most 
s<sup>2</sup> elements</li>
<li>The dirty area after step 5 places in tow kinds of position: between a column or ranges from 
a column to the next column, the first kind of dirty area is cleaned after step 5, the second 
kind of dirty area is cleaned after steps 6-8</li>
<li>If s does not divide r, the row generated by the cross of the original adjacent columns may 
also be dirty, the number of rows from this situation is at most s - 1, so the total number of 
dirty rows is at most 2s - 1, to hold these dirty rows, r must be at least \(2s(2s - 1)\)</li>
<li>Take out some elements from the array to let the numbers of elements in the array meet the 
requirement of division, perform columnsort, and at last put the taken elements in the right 
place of the sorted array</li>
</ol>
<p>
This algorithm can benefit from parallel processing (<a href="../codes/columnsort.c">implementation</a>)
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Travis CI User</p>
<p class="date">Created: 2019-06-06 Thu 03:07</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
